aalib: Portable ASCII art graphics library
angular-cli: CLI tool for Angular
ansiweather: Weather in your terminal, with ANSI colors and Unicode symbols
aom: Codec library for encoding and decoding AV1 video streams
asciiquarium: Aquarium animation in ASCII art
assimp: Portable library for importing many well-known 3D model formats
autoconf: Automatic configure script builder
automake: Tool for generating GNU Standards-compliant Makefiles
aview: ASCII-art image browser and animation viewer
bandwhich: Terminal bandwidth utilization tool
bash: Bourne-Again SHell, a UNIX command interpreter
bash-completion: Programmable completion for Bash 3.2
bash-git-prompt: Informative, fancy bash prompt for Git users
bat: Clone of cat(1) with syntax highlighting and Git integration
bdw-gc: Garbage collector for C and C++
berkeley-db: High performance key/value database
brew-cask-completion: Fish completion for brew-cask
brotli: Generic-purpose lossless compression algorithm by Google
c-ares: Asynchronous DNS library
ca-certificates: Mozilla CA certificate store
cairo: Vector graphics library with cross-device output support
cask: Emacs dependency management
cassandra: Eventually consistent, distributed key-value store
cataclysm: Fork/variant of Cataclysm Roguelike
cjson: Ultralightweight JSON parser in ANSI C
clang-format: Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
cf-cli: [no description]
cmake: Cross-platform make
cmark-gfm: C implementation of GitHub Flavored Markdown
cmatrix: Console Matrix
cmocka: Unit testing framework for C
commitizen: Defines a standard way of committing rules and communicating it
coreutils: GNU File, Shell, and Text utilities
cowsay: Configurable talking characters in ASCII art
ctags: Reimplementation of ctags(1)
curl: Get a file from an HTTP, HTTPS or FTP server
dart: SDK
dav1d: AV1 decoder targeted to be small and fast
dbus: Message bus system, providing inter-application communication
deno: Secure runtime for JavaScript and TypeScript
docker: Pack, ship and run any application as a lightweight container
double-conversion: Binary-decimal and decimal-binary routines for IEEE doubles
dsq: CLI tool for running SQL queries against JSON, CSV, Excel, Parquet, and more
emacs: GNU Emacs text editor
emscripten: LLVM bytecode to JavaScript compiler
erlang: Programming language for highly scalable real-time systems
ffmpeg: Play, record, convert, and stream audio and video
figlet: Banner-like program prints strings as ASCII art
findutils: Collection of GNU find, xargs, and locate
flac: Free lossless audio codec
fontconfig: XML-based font configuration API for X Windows
fortune: Infamous electronic fortune-cookie generator
freetype: Software library to render fonts
frei0r: Minimalistic plugin API for video effects
fribidi: Implementation of the Unicode BiDi algorithm
fzf: Command-line fuzzy finder written in Go
gd: Graphics library to dynamically manipulate images
gdb: GNU debugger
gdbm: GNU database manager
gdk-pixbuf: Toolkit for image loading and pixel buffer manipulation
gettext: GNU internationalization (i18n) and localization (l10n) library
gh: GitHub command-line tool
ghc: Glorious Glasgow Haskell Compilation System
giflib: Library and utilities for processing GIFs
git: Distributed revision control system
git-lfs: Git extension for versioning large files
glfw: Multi-platform library for OpenGL applications
glib: Core application library for C
global: Source code tag system
glow: Render markdown on the CLI
gmp: GNU multiple precision arithmetic library
gnu-indent: C code prettifier
gnu-sed: GNU implementation of the famous stream editor
gnu-typist: GNU typing tutor
gnu-units: GNU unit conversion tool
gnutls: GNU Transport Layer Security (TLS) Library
gobject-introspection: Generate introspection data for GObject libraries
googler: Google Search and News from the command-line
gradle: Open-source build automation tool based on the Groovy and Kotlin DSL
graphite2: Smart font renderer for non-Roman scripts
graphviz: Graph visualization software from AT&T and Bell Labs
grep: GNU grep, egrep and fgrep
grip: GitHub Markdown previewer
gsl: Numerical library for C and C++
gts: GNU triangulated surface library
guile: GNU Ubiquitous Intelligent Language for Extensions
harfbuzz: OpenType text shaping engine
heroku: Everything you need to get started with Heroku
heroku-node: node.js dependency for heroku
highway: Performance-portable, length-agnostic SIMD with runtime dispatch
historian: Command-line utility for managing shell history in a SQLite database
htop: Improved top (interactive process viewer)
http-server: Simple zero-configuration command-line HTTP server
hunspell: Spell checker and morphological analyzer
icu4c: C/C++ and Java libraries for Unicode and globalization
imath: Library of 2D and 3D vector, matrix, and math operations
jansson: C library for encoding, decoding, and manipulating JSON
jasper: Library for manipulating JPEG-2000 images
jemalloc: Implementation of malloc emphasizing fragmentation avoidance
jenkins: Extendable open source continuous integration server
jenv: Manage your Java environment
jmeter: Load testing and performance measurement application
jo: JSON output from a shell
jpeg: Image manipulation library
jpeg-turbo: JPEG image codec that aids compression and decompression
jpeg-xl: New file format for still image compression
jq: Lightweight and flexible command-line JSON processor
kafka: Open-source distributed event streaming platform
krb5: Network authentication protocol
lame: High quality MPEG Audio Layer III (MP3) encoder
leptonica: Image processing and image analysis library
libarchive: Multi-format archive and compression library
libass: Subtitle renderer for the ASS/SSA subtitle format
libavif: Library for encoding and decoding .avif files
libb2: Secure hashing function
libbluray: Blu-Ray disc playback library for media players like VLC
libcbor: CBOR protocol implementation for C and others
libev: Asynchronous event library
libevent: Asynchronous event library
libffi: Portable Foreign Function Interface library
libfido2: Provides library functionality for FIDO U2F & FIDO 2.0, including USB
libidn2: International domain name library (IDNA2008, Punycode and TR46)
libmng: MNG/JNG reference library
libmodplug: Library from the Modplug-XMMS project
libnghttp2: HTTP/2 C Library
libogg: Ogg Bitstream Library
libpng: Library for manipulating PNG images
libproxy: Library that provides automatic proxy configuration management
libpthread-stubs: X.Org: pthread-stubs.pc
librist: Reliable Internet Stream Transport (RIST)
librsvg: Library to render SVG files using Cairo
libsamplerate: Library for sample rate conversion of audio data
libsndfile: C library for files containing sampled sound
libsodium: NaCl networking and cryptography library
libsoxr: High quality, one-dimensional sample-rate conversion library
libssh2: C library implementing the SSH2 protocol
libtasn1: ASN.1 structure parser library
libtermkey: Library for processing keyboard entry from the terminal
libtiff: TIFF library and utilities
libtool: Generic library support script
libunistring: C string library for manipulating Unicode strings
libuv: Multi-platform support library with a focus on asynchronous I/O
libvidstab: Transcode video stabilization plugin
libvmaf: Perceptual video quality assessment based on multi-method fusion
libvorbis: Vorbis General Audio Compression Codec
libvpx: VP8/VP9 video codec
libvterm: C99 library which implements a VT220 or xterm terminal emulator
libx11: X.Org: Core X11 protocol client library
libxau: X.Org: A Sample Authorization Protocol for X
libxcb: X.Org: Interface to the X Window System protocol
libxdmcp: X.Org: X Display Manager Control Protocol library
libxext: X.Org: Library for common extensions to the X11 protocol
libxml2: GNOME XML library
libxrender: X.Org: Library for the Render Extension to the X11 protocol
libyaml: YAML Parser
libzip: C library for reading, creating, and modifying zip archives
little-cms2: Color management engine supporting ICC profiles
lolcat: Rainbows and unicorns in your console!
lsd: Clone of ls with colorful output, file type icons, and more
lua: Powerful, lightweight programming language
luajit: Just-In-Time Compiler (JIT) for the Lua programming language
luajit-openresty: OpenResty's Branch of LuaJIT 2
luv: Bare libuv bindings for lua
lynx: Text-based web browser
lz4: Extremely Fast Compression algorithm
lzo: Real-time data compression library
m4: Macro processing language
macos-term-size: Get the terminal window size on macOS
markdown: Text-to-HTML conversion tool
maven: Java-based project management
maven-completion: Bash completion for Maven
mbedtls: Cryptographic & SSL/TLS library
md4c: C Markdown parser. Fast. SAX-like interface
mdp: Command-line based markdown presentation tool
mit-scheme: MIT/GNU Scheme development tools and runtime library
mongodb-community: High-performance, schema-free, document-oriented database
mongodb-database-tools: This package contains standard utilities for interacting with MongoDB.
mongosh: MongoDB Shell to connect, configure, query, and work with your MongoDB database
mono: Cross platform, open source .NET development framework
monolith: CLI tool for saving complete web pages as a single HTML file
mpdecimal: Library for decimal floating point arithmetic
mpg123: MP3 player for Linux and UNIX
msgpack: Library for a binary-based efficient data interchange format
mysql: Open source relational database management system
ncdu: NCurses Disk Usage
ncurses: Text-based UI library
neovim: Ambitious Vim-fork focused on extensibility and agility
netpbm: Image manipulation
nettle: Low-level cryptographic library
nghttp2: HTTP/2 C Library
node: Platform built on V8 to build network applications
node@14: Platform built on V8 to build network applications
node@16: Platform built on V8 to build network applications
oniguruma: Regular expressions library
opencore-amr: Audio codecs extracted from Android open source project
openexr: High dynamic-range image file format
openjdk: Development kit for the Java programming language
openjdk@11: Development kit for the Java programming language
openjdk@17: Development kit for the Java programming language
openjpeg: Library for JPEG-2000 image manipulation
openldap: Open source suite of directory software
openssl@1.1: Cryptography and SSL/TLS Toolkit
opus: Audio codec
osx-cpu-temp: Outputs current CPU temperature for OSX
p11-kit: Library to load and enumerate PKCS#11 modules
pango: Framework for layout and rendering of i18n text
pcre: Perl compatible regular expressions library
pcre2: Perl compatible regular expressions library with a new API
perl: Highly capable, feature-rich programming language
springboot: [no description]
pixman: Low-level library for pixel manipulation
pkg-config: Manage compile and link flags for libraries
plantuml: Draw UML diagrams
postgresql@14: Object-relational database system
progress: Coreutils progress viewer
protobuf: Protocol buffers (Google's data interchange format)
protobuf@3.7: Protocol buffers (Google's data interchange format)
pup: Parse HTML at the command-line
python-typing-extensions: Backported and experimental type hints for Python
python@3.10: Interpreted, interactive, object-oriented programming language
python@3.8: Interpreted, interactive, object-oriented programming language
python@3.9: Interpreted, interactive, object-oriented programming language
pyyaml: YAML framework for Python
qt: Cross-platform application and UI framework
qt@5: Cross-platform application and UI framework
rabbitmq: Messaging broker
rav1e: Fastest and safest AV1 video encoder
readline: Library for command-line editing
redis: Persistent key-value database, with built-in net interface
rogue: Dungeon crawling video game
rtmpdump: Tool for downloading RTMP streaming media
rubberband: Audio time stretcher tool and library
ruby: Powerful, clean, object-oriented scripting language
ruby@3.0: Powerful, clean, object-oriented scripting language
sass: Stylesheet Preprocessor
sbt: Build tool for Scala projects
screenfetch: Generate ASCII art with terminal, shell, and OS info
sdl2: Low-level access to audio, keyboard, mouse, joystick, and graphics
sdl2_image: Library for loading images as SDL surfaces and textures
sdl2_mixer: Sample multi-channel audio mixer library
sdl2_ttf: Library for using TrueType fonts in SDL applications
shfmt: Autoformat shell script source code
six: Python 2 and 3 compatibility utilities
sl: Prints a steam locomotive if you type sl instead of ls
slides: Terminal based presentation tool
snappy: Compression/decompression library aiming for high speed
speex: Audio codec designed for speech
sqlite: Command-line interface for SQLite
sqlmap: Penetration testing for SQL injection and database servers
srt: Secure Reliable Transport
task: Feature-rich console based todo list manager
tcl-tk: Tool Command Language
telnet: User interface to the TELNET protocol
terminal-notifier: Send macOS User Notifications from the command-line
tesseract: OCR (Optical Character Recognition) engine
thefuck: Programmatically correct mistyped console commands
theora: Open video compression format
tldr: Simplified and community-driven man pages
tmux: Terminal multiplexer
tnftp: NetBSD's FTP client
tomcat: Implementation of Java Servlet and JavaServer Pages
travis: Command-line client for Travis CI
tree: Display directories as trees (with optional color/HTML output)
tree-sitter: Parser generator tool and incremental parsing library
tty-clock: Digital clock in ncurses
tty-solitaire: Ncurses-based klondike solitaire game
unbound: Validating, recursive, caching DNS resolver
unibilium: Very basic terminfo library
universal-ctags: Maintained ctags implementation
utf8proc: Clean C library for processing UTF-8 Unicode data
vim: Vi 'workalike' with many additional features
watch: Executes a program periodically, showing output fullscreen
webp: Image format providing lossless and lossy compression for web images
wget: Internet file retriever
wxwidgets: Cross-platform C++ GUI toolkit
x264: H.264/AVC encoder
x265: H.265/HEVC encoder
xorgproto: X.Org: Protocol Headers
xpdf: PDF viewer
xvid: High-performance, high-quality MPEG-4 video library
xz: General-purpose data compression with high compression ratio
yuicompressor: Yahoo! JavaScript and CSS compressor
z: Tracks most-used directories to make cd smarter
zeromq: High-performance, asynchronous messaging library
zimg: Scaling, colorspace conversion, and dithering library
zlib: General-purpose lossless data-compression library
zookeeper: Centralized server for distributed coordination of services
zsh: UNIX shell (command interpreter)
zstd: Zstandard is a real-time compression algorithm
bluejeans
discord
firefox
font-hack-nerd-font
github
google-chrome
intellij-idea-ce
iterm2
mono-mdk
postman
racket
rectangle
robo-3t
slack
spotify
steam
tor-browser
twitch
visual-studio-code
vlc
